app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hercules"], ["rating", "PG"], ["release_date", "1997-06-27 00:00:00.000000"], ["created_at", "2015-10-23 04:01:41.744519"], ["updated_at", "2015-10-23 04:01:41.744519"]]
---
  def add_tmdb
    @movies_to_add = params[:tmdb_movies]

    if(@movies_to_add == nil)
      flash[:notice] = "No movies selected"
      redirect_to movies_path
    else
      @movies_to_add.keys.each do |movie|
        Movie.create_from_tmdb(movie)